# RampStartHigherThanEnd Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RampStartHigherThanEnd Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The ramp's base (base level + base offset) must be below its top (top level + top offset).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RampStartHigherThanEnd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RampStartHigherThanEnd As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RampStartHigherThanEnd {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace